10/data/attachments/bdc2a03b558335fc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:username>
            <nif:friendToBeAdded>Zachary_thousand_Friend_88858_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>